{
    "course": {
        "id": "154",
        "name": "Student Policies",
        "logo": "http://navgurukul.org/img/sqlogo.jpg",
        "notes": null,
        "days_to_complete": null,
        "short_description": "Ye hamare probation policies hain...",
        "type": "html",
        "course_type": null,
        "lang_available": [
            "en"
        ],
        "exercises": [
            {
                "id": "4572",
                "parent_exercise_id": null,
                "course_id": "154",
                "name": "Student Safeguarding Policy",
                "slug": "student-policies__Student_Safeguarding_Policy_md",
                "sequence_num": 0,
                "review_type": "manual",
                "submission_type": null,
                "github_link": "https://github.com/navgurukul/newton/tree/master/student-policies/Student_Safeguarding_Policy.md",
                "solution": null,
                "content": [
                    {
                        "type": "markdown",
                        "value": "You can find the Student Safeguarding Policy\n[here\n](https://drive.google.com/file/d/1kN5kmSJXaaHcfw1HiE08_1ixGIsYCI-x/view?usp=sharing)\n.\n"
                    }
                ]
            },
            {
                "id": "4574",
                "parent_exercise_id": null,
                "course_id": "154",
                "name": "Academic Probation Policy",
                "slug": "student-policies__Academic_Probation_Policy_md",
                "sequence_num": 100,
                "review_type": "manual",
                "submission_type": null,
                "github_link": "https://github.com/navgurukul/newton/tree/master/student-policies/Academic_Probation_Policy.md",
                "solution": null,
                "content": [
                    {
                        "type": "markdown",
                        "value": "Introduction\n\nWhat is Probation?\n\nIf a student does end up on academic probation, don't panic. Being placed on academic probation is usually not the same as being asked to leave campus. Students are given a probationary period to demonstrate that they can indeed make successful academic progress.  \n\n\n\nAcademic probation is to indicate that a student is not making progress Navgurukul required for completion of the software development course. It also means that a student’s grades and/or overall performance are not high enough to continue on campus if they do not improve.  \n\n\n\nWhat leads to Academic Probation?\n\nEvery student who is joining Navgurukul will be in the probation period for the first two months. A student is further placed on Academic Probation based on the following criteria.  \n\n\n\n\n- Based on the review of Coaches and Academic Associate, if it is found that a student is not serious about their academics\n  - And is not cleear with their previous concepts\n  - Making unnecessary excuses to avoid coding continuously for 15 days,\n  - Not giving 7 hours at least for coding in a day.\n\n- If a student is failing to maintain 70% of their engagement in academic activities such as\n  - Conducting Stand up,\n  - Participating in Academic circles,\n  - Involving in Pair-Peer Learning\n  - Taking classes\n  - Conducting and participating in interviews,\n  - Mentoring students\n  - Attending volunteer run sessions\n\n- If the student receives three red flags continuously in weekly assessment tests.\n\n\n\nHow can you clear the Academic Probation?\n\n- The student should be given a personal mentor and an advisor in resolving academic probation\n  - They will take the assistance of their assigned mentors daily in solving their problems in learning.\n  - Once in a week T&Ps will interview probationary students.\n  - Assigned mentors will give updates to Academic associates on alternate days. Students should make extra efforts and give extra time to studies, a change in his/her day to day schedule and share a proposed timeline to cope up with the studies.\n\n- Make a list of what he/she needs to do day-wise for a month\n  - Week 1 : Dry run needs to be done till the topic that student is doing under the guidance of the respective mentor, and then T&P will interview them and then work on feedback.\n  - Week 2: Each student needs to plan 3 classes till the topic with proper\ndocumentation which they need to share before the class and T&P will interview\nthem, then work on feedback.\n  - Week 3: Sprint and Projects decided by academic associates.\n  - Week 4: For checking their improvement we will give a new topic to complete\nwithin the timeline.\n  - The academic associates will take the final interview.\nSet up a personal hackathon often in this period, if needed\n\n\n\n\nSOP needs to be followed during Academic Probation\n\nStep: 1:\n\nWeekly feedback on progression to be given to the student by an Academic Associate or T&P and same to be communicated to the Academic lead/Program Manager (if student performance improved no need to follow next step)\n\n\n\nStep: 2:\n\nIn case if still there is no performance improvement after a month of feedback he/she should be placed under probation after discussing with the Academic lead/Program Manager\n\n\n\n\n- Join discussion with the Student, Academic Associate, and Academic\nlead/Program Manager on feedback and scope of the improvement plan\n\n- Academic Associate should send a formal notice to the student over the email.\n\n- Campus team to assign an advisor/mentee to the student who will mentor\npersonally for a month\n\n- Student to prepare a study planner and share the details with the team (tracker to be shared by the team)\n\n- Student to cut down from all the extracurricular activities in which he/she is\nenrolled\n\n- The student will be free to indulge in a personal hackathon, unlimited until the\nprobation period continue\n\n- Academic associate to closely monitor the student for a month and help him/her\nwith timely feedback and guidance\n\n\n\nStep: 3:\n\nAfter completion of 30 days in probation Academic Associate reviews the performance and shares the final report with the team.\n\n\n\n- If there is improvement in the student’s progress, then the probationary period\nwill be discontinued.\n\n- If there is no satisfactory progress, as decided by the Academic Associate, step 4 needs to be followed.\n\n\n\nStep:4:\n\nA joint discussion with the student, student Parents/Guardian, Academic Associate, Academic lead, Program Manager, and Program Lead\n\n\n\n- Team to discuss with the student and his/her parents/guardian if he/she is willing to give a last try\n  - If the student is willing to try, the team has to give a grace period of 15\ndays to work with the student and help him/her improve academically\n  -  If the student is not willing to give it a try, share the final termination notice with the student, parents/guardian, and partners\n\n\n\nStep: 5:\n\nIf there is improvement in the student’s progress, then the probationary period will be discontinued.\n\n\n\nIf there is no satisfactory progress, as decided by the Academic Associate, share the final termination notice with the student, parents/guardian, and partners\n\n"
                    }
                ]
            },
            {
                "id": "4575",
                "parent_exercise_id": null,
                "course_id": "154",
                "name": "Cultural Probation Policy",
                "slug": "student-policies__Cultural_Probation_Policy_md",
                "sequence_num": 200,
                "review_type": "manual",
                "submission_type": null,
                "github_link": "https://github.com/navgurukul/newton/tree/master/student-policies/Cultural_Probation_Policy.md",
                "solution": null,
                "content": [
                    {
                        "type": "markdown",
                        "value": "1. Introduction\n\nThe purpose of the policy is to create a safe environment in the campus with\nregards to herself and others including the students and team members. The\nneed of the policy is to provide a space for the student to reflect, understand and take accoun`tab`ility and responsibility for his/her actions and reactions.\n\n\n\n\nKeeping in mind the usage of probation in the current document is not to provide\nany form of threatening and non-inclusivity approach. It is drafted in a way\naligning to the thought and vision of the organization, NavGurukul, which caters\nto re-working and supporting the overall performance of the student.\n\n\n\n2. What leads to culture probation?\n\nWhere a student has been found responsible for violating the environment,\ndiscipline, rules and regulations and has been engaged in an activity which\nis unaccep`tab`le and poses threat to the immediate community.\n\n\n\n3. SOP needs to be followed during Culture Probation\n\nStep 1:\n\nThere needs to be a detailed conversation regarding the student between\nthe DISCO and community manager about the history of the student.\n\n\n\nStep 2 :\n\nIf the incidences of disciplinary issues are surpassing the limit, the\ncommunity manager will `loop` in the Program Manager along with Program lead\nfor discussing the issue in a joint call.\n\n\n\nStep 3:\n\nAs the second warning will be provided by the Program Lead along with\nthe campus team to the student, which will be `execute`d a) via joint call b) via\nemail with detailed information.\n\n\n\nStep 4 :\n\nThe email will be the third warning stage for the student , which will have\na probation tenure of the student (one month probation period), jointly decided\nby the team.\n\n\n\nStep 5:\n\nThe final stage will be suspension. After following all the above steps if there is no sign of improvement, the campus team jointly with the lead will opt for suspension of the student and discuss the same with the associated\nstakeholders (NGO Partners/Guardians).\n\n\n\n4. Additional Step to be followed by Campus Team\n\nStep 1 :\n\nThe community manager needs to maintain the tracker of the students creating repetitive and multiple disciplinary issues in the campus.\n\n\n\nStep 2:\n\nThe following tracker needs to be shared with the campus team + outreach team and with the DISCO.\n\n\n\nStep 3 :\n\nWhile the student who is culture probation period, they will be exempted\nto participate in council elections/ stand for any of the council post.\n\n"
                    }
                ]
            },
            {
                "id": "4577",
                "parent_exercise_id": null,
                "course_id": "154",
                "name": "Leave Policy for Students",
                "slug": "student-policies__Leave_Policy_md",
                "sequence_num": 300,
                "review_type": "manual",
                "submission_type": null,
                "github_link": "https://github.com/navgurukul/newton/tree/master/student-policies/Leave_Policy.md",
                "solution": null,
                "content": [
                    {
                        "type": "markdown",
                        "value": "Leave Policy\n\n*Effective since 1st February 2021*\n\n\n\nNavGurukul’s one-year residential program is an intensive program. It requires your extraordinary commitment, passion & hard work. The program relies on peer learning, and expects you to be available all throughout the year to maximise  your learning and ensure that every student learns well. \n\n\n\nHowever, keeping your needs and well-being in mind, certain leaves have been allocated for you if you wish to avail them. We trust that you will use these leaves wisely and with full consideration towards your studies at NavGurukul.\n\n\n\n**Academic Leaves:** You can avail leaves from NavGurukul if you have college exams coming up. You will have to submit your exam schedule to the concerned person to avail these leaves. Preparation leaves of maximum 2 weeks can be taken (if needed) just before the exam. Information about upcoming college exams should be shared with the NavGurukul team during your admission.\n\n\n\n**Medical Leaves:** You can apply for medical leave in case you need to go home in the event of illness that requires severe medical attention or surgery. You would be required to present a medical certificate to avail this leave for upto a period of 14 days.\n\n\n\n**Personal Leaves:** You can take leaves for personal reasons that are not academic/medical in nature for upto 14 days or 2 weeks. The allotment of personal leaves will be the discretion of the facha. This could include leaves for any reasons related to your family or your emotional health.\n\n\n\nYou can avail these leaves when needed provided that you have applied for the leave well in advance. Also, the following conditions apply for leaves.\n\n\n\n* You are only eligible for personal leaves if you don’t have any exams lined up throughout the year i.e. you cannot avail both academic and personal leaves. Personal leaves also can’t be taken if you have already taken medical leaves.\n\n* You have to apply in writing at least 2 weeks in advance for academic / personal leaves. \n\n* You can only leave the campus if you get permission in writing from the facha. \n\n* At any given point of time, not more than 10% of the students from a campus can be on leave. \n\n* Personal leaves cannot be taken during the probation period. \n\n* Personal leaves cannot be taken during the first 4 months of your time in NavGurukul.\n\n\n\nProcess of Applying for Leaves\n\n* You need to fill the leave `application` form at least 2 weeks in advance.\n\n* You need to write an email addressing the facha and keep the Program Manager and DISCO in cc.\n\n* You will receive an email once your facha has reviewed your `application` and either approved/ disapproved your leave.\n\n* In case of any grievances, you can revert to the facha in charge through email only. They will review your grievance and revert to you.\n\n\n\n\nUnauthorized Leaves\n\nTaking unauthorized leaves or extending your leaves without a valid reason and proper communication hurts the interests of the community and belittles the trust that has been placed in you. Therefore, we would urge you to communicate and plan honestly and well in advance for your leaves. In the case that you take unauthorized leaves, disciplinary action might be taken. We hope you will act responsibly.\n\n\n\nThe leave policy can be revised as and when needed. \n\n\n\nHolidays\n\nThere is one weekly holiday on campus. The day of the leave is decided jointly by the community and campus team. Students can choose to take rest or go out of the campus on this day. However, they have to be back on campus by the curfew time. Sometimes, due to some academic reason or community related reasons, this holiday could be cancelled or rescheduled. The community is expected to cooperate in such circumstances.\n\n\n\nFestivals\n\nFestivals are a time to celebrate and spread laughter and joy within the community. We don’t encourage students taking leaves during festivals. The community can together decide which festivals they wish to celebrate together. These days will not be holidays but celebration days. The community members are encouraged to participate in preparations for the days and make it a day of fun and frolic. It will not be considered as a holiday in which they can go out. Every campus can have their own celebration days.\n\n"
                    }
                ]
            },
            {
                "id": "4573",
                "parent_exercise_id": null,
                "course_id": "154",
                "name": "Laptop Policy and Procedure Handbook",
                "slug": "student-policies__Laptop_Policy_md",
                "sequence_num": 400,
                "review_type": "manual",
                "submission_type": null,
                "github_link": "https://github.com/navgurukul/newton/tree/master/student-policies/Laptop_Policy.md",
                "solution": null,
                "content": [
                    {
                        "type": "markdown",
                        "value": "Student Laptop Policy and Procedure Handbook\n\n*The policy is subject to change as and when required by the management & agreements.*\n\n\n\nThis policy is created to define the laptop usage policy for the students which will be rendered by Nav Gurukul during their course period at the residential campus.\n\n\n\nIntroduction\n\nThis document presents the policy adopted by Navgurukul regarding mandatory use of Laptops by all the students of all academic programs. The policy has been formulated given the significant impact of laptops on academic outcomes, and the current usage of laptops by the regular students at Navgurukul. This policy deals with usage and permission for the students, eligibility criteria for the same. This policy has been framed with a futuristic approach keeping in view the fast rate of redundancy of computer hardware and software. \n\n\n\nLaptop as learning tools\n\nThe `application` of enabling technologies has a far-reaching impact on the learning environment of Navgurukul Campus. The por`tab`le electronic devices viz, laptops are being increasingly used by the students as a learning tool in Navgurukul Foundation. Navgurukul is striving for optimum integration of state-of-the-art technologies with the online curriculum and formulation of a policy for mandatory use of laptops by all the students is a step towards the direction. In Navgurukul we provide a personal laptop to each student to have a change experience of learning globally as students can organize and access their learning source at a fast pace. We provide a personal laptop to the students to facilitates 24/7 interactive learning as it enables students and faculty to connect through continuous information exchange. The por`tab`ility of laptop leads to seamless merging of classroom learning with learning outside the classroom and helps students carry out research and gather `inputs` for their course from institutional online resources and open access sources on the internet anywhere anytime \n\n\n\nPolicy\n\nIn view of the above, the Student Laptop Policy has been framed making the use of laptops mandatory for all the students of regular academic programs at all the campuses. Following are the provisions of the policy: \n\n1. Students of the regular academic program of Navgurukul Foundation must use a laptop during the whole period of a year during the ongoing academic course on the campus \n\n2. Once the student completes the course and gets selected for the job they are supposed to return the laptop to the IT team.\n\n3. Alumni who are in internship period and continuing his/her stay in Navgurukul campus can continue the use of a laptop for enhancing their soft skill in case if they are not provided a laptop/desktop from their respective organization, until the end of the internship period \n\n4. Alumni are not allowed to carry laptop out of Navgurukul Campus in any situation \n\n5. The laptop is completely owned by Navgurukul foundation, none of the students are allowed to carry the laptop out of the campus in any scenario \n\n6. IT Help/Service Desk of Navgurukul will ensure that each student is equipped with the minimum required processing system and software to operate the basic utilities of laptops \n\n7. IT Help/Service Desk of each campus will organize an orientation program during the first week of joining of the student for the software used by Navgurukul for various academic program \n\n8. The software installed by the IT Help/Service Desk must remain on the laptop in usable condition and be easily accessible at all times \n\n9. Students are responsible for their laptops at all times. Students should use the laptops responsibly, safely, and respectfully. \n\n10. General care of the laptop should be taken care of by the student \n\n11. Students are supposed to keep their laptop in their possession and within sight whenever possible, just as if it were your wallet, handbag, or mobile phone. Be extra careful in classrooms. It takes just a fraction of a second to cause damage to an unattended laptop. \n\n12. Lock the laptop away out of sight when you are not using it, preferably in a strong cupboard, filing cabinet, or safe. This applies in the classroom or in your room. \n\n13. When the laptop is not in use, please store it in a secure location \n\n14. Keep a note of the make, model, serial number, and the asset label of your laptop but do not keep this information with the laptop. \n\n15. If a laptop is damaged or malfunctioning, it must be reported immediately so repair can be made. \n\n16. Any damage related to a faulty battery, loose connection, ram, or software issue will be repaired by Navgurukul \n\n17. Any personal damage or loss to a laptop that occurs due to negligence of a student will be investigated by the Campus Manager and will be chargeable as per the standard market rate if found guilty \n\n\n\nVirus and Threat\n\n18. Viruses are a major threat to and laptops are particularly vulnerable if their anti-virus software is not kept up-to-date. The anti-virus software MUST be updated at least monthly. The easiest way of doing this is simply to log on to the network for the automatic update process to run. If you cannot log on for some reason, contact the IT Help/Service Desk for advice on obtaining and installing anti-virus updates. \n\n19. Email attachments are now the number one source of computer viruses. Avoid opening any email attachment unless you were expecting to receive it from that person.\n\n20. Always virus-scan any `files` downloaded to your computer from any source (CD/DVD, USB hard disks and memory sticks, network `files`, email attachments, or `files` from the Internet). Virus scans normally happen automatically but the IT Help/Service Desk can tell you how to initiate manual scans if you wish to be certain. \n\n21. Report any security incidents (such as virus infections) promptly to the IT Help/Service Desk in order to minimize the damage. \n\n22. Respond immediately to any virus warning message on your computer, or if you suspect a virus (e.g. by unusual `file` activity) by contacting the IT Help/Service Desk. Do not forward any `files` or `upload` data onto the network if you suspect your PC might be infected. \n\n23. Be especially careful to virus-scan your system before you send any `files` outside the Navgurukul Foundation. This includes EMAIL attachments and CD-ROMs that you create. \n\n24. Avoid leaving your laptop unattended and logged on. Always shut down, log off, or activate a password-protected screen`save`r before walking away from the machine. \n\n\n\nUnauthorized software\n\n25. Do not download, install or use unauthorized software programs. Unauthorized software could introduce serious security vulnerabilities into the networks as well as affecting the working of your laptop. Software packages that permit the computer to be ‘remote controlled’ (e.g. PC anywhere) and ‘hacking tools’ (e.g. network sniffers and password crackers) are explicitly forbidden on equipment unless they have been explicitly pre-authorized by management for legitimate business purposes. \n\n\n\nUnlicensed software\n\n26. Be careful about software licenses. Most software, unless it is specifically identified as “freeware” or “public domain software”, may only be installed and/or used if the appropriate license fee has been paid. Shareware or trial packages must be deleted or licensed by the end of the permitted free trial period. Some software is limited to free use by private individuals whereas commercial use requires a license payment. Individuals and companies are being prosecuted for infringing software copyright: do not risk bringing yourself into disrepute by breaking the law. \n\n\n\nBackups\n\n27. Unlike desktop PCs which are backed up automatically by IT, you must take your own backups of data on your laptop. The simplest way to do this is to log in and `upload` data from the laptop to the network on a regular basis – ideally daily but weekly at least. If you are unable to access the network, it is your responsibility to inform such issues to IIT Help/Service Desk\nLaws, regulations, and policies \n\n28. You must comply with relevant laws, regulations, and policies applying to the use of computers and information. Software licensing has already been mentioned and privacy laws are another example. \n\n\n\nInappropriate materials\n\n29. Navgurukul will not tolerate inappropriate materials such as pornographic, racist, defamatory, or harassing `files`, pictures, videos, or email messages that might cause offense or embarrassment. Never store, use, copy or circulate such material on the laptop and steer clear of dubious websites. IT staff routinely monitor the network and systems for such materials and track the use of the Internet: they will report serious/repeated offenders and any illegal materials directly to management, and disciplinary processes will be initiated. If you receive inappropriate material by email or other means, delete it immediately. If you accidentally browse to an offensive website, click ‘back’ or close the window straight away. If you routinely receive a lot of spam, call the IT Help/Service Desk to check your spam settings. \n\n\n\nEnforcement\n\n30. Any student found to have violated this policy may be subjected to disciplinary action in line with the Policy.\n\n"
                    }
                ]
            },
            {
                "id": "4576",
                "parent_exercise_id": null,
                "course_id": "154",
                "name": "COVID Policies",
                "slug": "student-policies__COVID_Policies_md",
                "sequence_num": 500,
                "review_type": "manual",
                "submission_type": null,
                "github_link": "https://github.com/navgurukul/newton/tree/master/student-policies/COVID_Policies.md",
                "solution": null,
                "content": [
                    {
                        "type": "markdown",
                        "value": "You can find COVID policies of our different campuses linked underneath. \n\n\n\n- [Bangalore Campus](https://drive.google.com/file/d/1EfASmP2Ncqd08trPyJCcLy9TY4zjor3W/view?usp=sharing)\n- [Sarjapur Campus](https://drive.google.com/file/d/1DVZLY0ysKs43aOyuSSRBXObb895KdFwq/view?usp=sharing)\n- [Pune Campus](https://drive.google.com/file/d/1rgggy6kRnCJcoMElNbGDnTD7uyQ9vNIz/view?usp=sharing)\n- [Dharamshala Campus](https://drive.google.com/file/d/1W2-JPm9ELSFQAIewPtsWAitzrejA0SNP/view?usp=sharing)\n"
                    }
                ]
            },
            {
                "id": "4578",
                "parent_exercise_id": null,
                "course_id": "154",
                "name": "Alumni Policy",
                "slug": "student-policies__Alumni_policy_md",
                "sequence_num": 600,
                "review_type": "manual",
                "submission_type": null,
                "github_link": "https://github.com/navgurukul/newton/tree/master/student-policies/Alumni_policy.md",
                "solution": null,
                "content": [
                    {
                        "type": "markdown",
                        "value": "Alumni Policy\n\n*The policy is subject to change as and when required by the management & agreements.*\n\n\n\n**Introduction:** This policy is created to define the guideline and roles and responsibility of the Alumni with the facilities which will be rendered by Nav Gurukul during the Alumni period. \n\n\n\nLife Cycle from Student to Alumni in Nav Gurukul:\n\n* Students who join Nav Gurukul Campus and complete the prescribed course on a given period\n\n* Once the course is successfully completed, students are placed for an interview by the Nav Gurukul team\n\n* Based on the skill set of the student, he/she gets selected for the Job\n\n* Once the student gets selected and onboarded on Job they are known as Alumni\n\n* During the initial phase of Job **(Internship periods/ Training Period)**, Navgurukul extends their support by providing accommodation to the Alumni in the Campus\n\n* Alumni have to follow certain guidelines which are mentioned below\n\n\n\nGuidelines and Roles and Responsibilities of Alumni:\n\n* From the first date of joining the job until 45 days, Navgurukul will extend their support by providing **food, shared accommodation, wifi, and first aid** to the Alumni within the campus. \n\n* Alumni stay can be extended only if the Alumni internship/training period is more than 45 days which can vary from 1 month to 6 months\n\n* During this period (45 days), alumni are advised to look for another option to stay outside the campus premises.\n\n* Alumni can rejoin the campus post the completion of one year residential course on below condition:\n\n*   For skill enhancement - specifically coding, programming languages.\n\n*   Alumni can rejoin interim while the period of internship is not over upto his/her internship period\n\n* Incase if the Alumni willing to continue their stay in the campus after internship/training period he/she have to pay a monthly rent which will be **INR 4,500/-** per month which will include food, accommodation and other utilities\n\n* In addition to being the alumnus/ae of Nav Gurukul, the alumni should also contribute to the culture and community of Navgurukul. The primary responsibility of the Alumni will be which is as follows:\n\n*   **Community Work**- Once in 15 days Cooking, Campus Cleaning, Shopping Vege`tab`le/ Groceries \n\n*   **Community Engagement**- Cultural Activity, Appreciation Circle, Townhall, Life mapping. \n\n*   **Student Engagement**- Mentoring students in their areas of expertise, guiding students on their career path, building the confidence of the student by sharing his/her personal work experience\n\n*   **Sponsorship**: A voluntary contribution towards the scholarship for the deserving student from the campus by Pay Forward plan\n\n"
                    }
                ]
            }
        ]
    }
}